Canonical-Flows/boundaryLayer/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.12e-2;

boundaryField
{
    inlet
    {
        type            calculated;
		value			$internalField;
    }

    outlet
    {
        type            calculated;
		value			$internalField;
    }

    top
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
	
	plate
    {
        type            nutkWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
